# ```
# 2) მომხმარებელს შეაყვანინეთ ორი მთელი რიცხვი. შეამოწმეთ და დაბეჭდეთ შემდეგი შედარებების შედეგები:
# - პირველი რიცხვი მეტია მეორეზე თუ არა;
# - პირველი რიცხვი ნაკლებია მეორეზე თუ არა;
# - რიცხვები ერთმანეთის ტოლია თუ არა.

# 3) მომხმარებელს შეაყვანინეთ გამოცდაზე მიღებული ქულა (0-დან 100-მდე). შეამოწმეთ, არის თუ არა ქულა 50-ზე მეტი ან ტოლი. დაბეჭდეთ შედარების შედეგი.

# 4) მომხმარებელს შეაყვანინეთ პროდუქტის ფასი და თანხა, რომელსაც იხდის. გარდაქმენით ორივე მნიშვნელობა float ტიპად და შეამოწმეთ, საკმარისია თუ არა მომხმარებლის თანხა პროდუქტის შესაძენად.

# 5) მომხმარებელს შეაყვანინეთ მთელი რიცხვი. გამოიყენეთ შედარების ოპერატორი == და ნაშთის ოპერატორი %, რათა შეამოწმოთ, იყოფა თუ არა რიცხვი 2-ზე უნაშთოდ. დაბეჭდეთ შედარების შედეგი.
# ```


#shedarebebi

# num1 = int(input('please enter number: '))

# num2 = int(input('please enter number: '))

# print(num1>num2)
# print(num1<num2)
# print(num1==num2)

# #qulebi

# score = int(input('please enter score: '))

# print(score>50)


#produqtebi

# money = float(input('please enter money: '))


# price = float(input('please enter price: '))

# print(type(money))
# print(type(price))

# print(money>price)

#unashtod gayofa 2ze



a = int(input('please enter number: '))

print(a % 2 == 0)








